       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO.
       PROCEDURE DIVISION.
           DISPLAY "HELLO FROM COBOL ON SAP HANA!".
           STOP RUN.
